trade_exp/src/Documents/АктОРасхожденияхПослеПеремещения/АктОРасхожденияхПослеПеремещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="af172ffa-c1ad-407a-8f45-6f3200265096">
  <name>АктОРасхожденияхПослеПеремещения</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.ТоварыКОтгрузкеПоНакладным</registerRecords>
  <attributes extendedConfigurationObject="cb8fe983-3a0e-4691-8821-32135f680678">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ceef33fc-b037-4778-9a56-8d3c33a93e19">
    <name>ОрганизацияПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cbff09d2-d529-4720-93aa-be510323dfaa">
    <name>СкладОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cb1ddde6-eb79-482e-a410-70887847ccd8">
    <name>СкладПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0722bc40-03c3-4ee3-a0f1-c8c6cca637f1">
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d922f5ac-9f0b-405a-82e3-7625cc3601c7">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2f0fe03a-a1b4-4897-a40c-3738f0ccaa56">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="82a5f355-8fd0-4e9a-99f9-8c795e7f5dd1">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="784736c7-90b5-4b41-a6d7-39b8a2615247">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3e2399d1-a2c2-4854-a4ca-7c055c972505">
    <name>ИсключитьИзКонтроля</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="272e1fa8-9def-4676-9019-363b879755ce">
    <name>ДатаОтработки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6ee497b1-1e0c-43d3-a7e9-08e21f7d0d40">
    <name>ОтработанБезРазбора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="61efd39e-3811-4df9-b25b-3ed902d3cee8">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e142c880-ca4a-404d-b1a4-0fe89b95bff1">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="317d4103-73cd-4b74-bad6-6ac08c5a26f0">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ea2bc250-1bf2-447c-8afa-679066440e9d">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d286f92f-0066-4cbc-b43f-84d1a4d7fd09">
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7af13f0e-7d2a-43bc-b50b-0433b43d6163">
      <name>ТекстовоеОписание</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="113d2cdf-223f-4192-bf21-d0cacbd5aa72">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a1ed03f5-f17a-4125-a3ee-5f56a2e5e6ec">
      <name>КомментарийПолучателя</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7a6ac9f5-56e0-4bf8-9bac-221813ee501a">
      <name>КоличествоУпаковокПоДокументу</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="3c6c3875-f18a-420e-851b-89061eb15401">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ac39d370-cfc5-401b-ac2f-980d8c279870">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="af318b4b-f6a5-4f8c-bfde-7be909b884ea">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="51890e5d-f996-4d59-bc4d-cb73a9a8b530">
      <name>Действие</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5cd725a5-130d-4fb3-a73a-f36ecaaf186b">
      <name>Заказ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="822464c2-4343-473e-9cf7-aa599f3d0518">
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="904a4b94-7fd0-447b-ad4b-7e1b00c166ad">
      <name>КомментарийМенеджера</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5030b6ce-807d-4502-9efc-fd685b1ae3df">
      <name>СуммаРасхождений</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="cbaa155e-3e7c-4a5d-a9f7-f95c093cc07e">
      <name>НазначениеОтправителя</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/РазмещениеНоменклатурыПоСкладскимЯчейкам/РазмещениеНоменклатурыПоСкладскимЯчейкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РазмещениеНоменклатурыПоСкладскимЯчейкам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ОсновнаяЯчейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7150e659-c510-45e5-9deb-fddf7441e996">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>МногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Товар</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Работа</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Набор</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/СтатусыАктаОРасхождениях/СтатусыАктаОРасхождениях.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыАктаОРасхождениях</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Согласовано</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НеСогласовано</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КВыполнению</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Претензия</name>
  </enumValues>
  <enumValues>
    <name>Отработано</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ВариантыДействийПоРасхождениямВАктеПослеОтгрузки/ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыДействийПоРасхождениямВАктеПослеОтгрузки</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="b4cd5cf2-becc-47fc-acc1-3f5e388de5cc">
    <name>ПокупкаПерепоставленного</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="017e9b68-db4c-46f6-88bb-302b1d077101">
    <name>ДопоставкаНеТребуется</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0192c7a0-d8f4-421f-84c3-0422e7c325bf">
    <name>ПерепоставленноеДарится</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="47556336-3f8c-4d55-9a13-9637c157cae2">
    <name>ТребуетсяДопоставка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7be36844-c452-4b1b-b08c-6918502de0d0">
    <name>ОтгрузитьСейчас</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f22e447b-d61a-47cc-88c8-6ee796c1e050">
    <name>НедостачаНеПризнана</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1b2d946d-c9f5-4037-8399-87421b020da2">
    <name>ВозвратПерепоставленного</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f534a5d7-38e3-40b1-a5a3-1b2ebd98de08">
    <name>ОприходоватьСейчас</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/СписаниеНедостачТоваров/СписаниеНедостачТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СписаниеНедостачТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ВидДеятельностиНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АналитикаАктивовПассивов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АналитикаРасходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПересчетТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИсточникИнформацииОЦенахДляПечати</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2a759476-634c-49ca-98f6-188e8168647e">
    <name>ИсключитьИзКонтроля</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b233622f-e90f-48dd-9caf-289bb72dd238">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Кладовщик</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="80f88656-3c34-46f6-be0d-e204c50e6846">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/АктОРасхожденияхПослеПеремещения/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После ("ДобавитьКомандыСозданияНаОсновании")
Процедура Док_ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.ПорчаТоваров.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.СписаниеНедостачТоваров.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.ОприходованиеИзлишковТоваров.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.ПересортицаТоваров.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.ОрдерНаОтражениеИзлишковТоваров.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.ОрдерНаОтражениеНедостачТоваров.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.ОрдерНаОтражениеПересортицыТоваров.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

//&После ("ОформитьИзлишкиНедостачиНаСкладе")
//Процедура ОформитьИзлишкиНедостачиНаСкладеПосле(Запрос, ТекстыЗапроса, Регистры) 
//	 
//	 	СодержитРегистрТоварыНаСкладах = Ложь;
//	СодержитРегистрТоварыКОформлениюИзлишковНедостач = Ложь;
//	Если ЗначениеЗаполнено(Регистры) Тогда
//		Если ТипЗнч(Регистры) = Тип("Строка")
//			И Регистры = "ТоварыНаСкладах" Тогда
//			СодержитРегистрТоварыНаСкладах = Истина;
//		ИначеЕсли ТипЗнч(Регистры) = Тип("Строка")
//			И Регистры = "ТоварыКОформлениюИзлишковНедостач" Тогда
//			СодержитРегистрТоварыКОформлениюИзлишковНедостач = Истина;
//		ИначеЕсли ТипЗнч(Регистры) = Тип("Структура") Тогда
//			Если Регистры.Свойство("ТоварыНаСкладах") Тогда
//				СодержитРегистрТоварыНаСкладах = Истина;
//			КонецЕсли;
//			Если Регистры.Свойство("ТоварыНаСкладах") Тогда
//				СодержитРегистрТоварыКОформлениюИзлишковНедостач = Истина;
//			КонецЕсли;
//		КонецЕсли;
//	КонецЕсли;
//
//	Если СодержитРегистрТоварыКОформлениюИзлишковНедостач Тогда
//		// 
//		ТекстЗапросаДокумента =
//		"ВЫБРАТЬ
//		|	ТаблицаТовары.Ссылка КАК Ссылка,
//		|	ТаблицаТовары.Ссылка.Дата КАК Дата,
//		|	ТаблицаТовары.Ссылка.СкладПолучатель КАК Склад,
//		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
//		|	ТаблицаТовары.Характеристика КАК Характеристика,
//		|	ТаблицаТовары.Назначение КАК Назначение,
//		|	ТаблицаТовары.Серия КАК Серия,
//		|	ТаблицаТовары.КоличествоПоДокументу - ТаблицаТовары.Количество КАК Количество,
//		|	ТаблицаТовары.СтатусУказанияСерий КАК СтатусУказанияСерий
//		|ИЗ
//		|	Документ.АктОРасхожденияхПослеПеремещения.Товары КАК ТаблицаТовары
//		|ГДЕ
//		|	ТаблицаТовары.Ссылка В(&Ссылка)
//		|	И ТаблицаТовары.Ссылка.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.КВыполнению), ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.Отработано))
//		|	И  ТаблицаТовары.Действие В (ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.НедостачаНеПризнана))
//		|				И ТаблицаТовары.Ссылка.СкладПолучатель.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач = ИСТИНА
//		|				И ТаблицаТовары.Ссылка.СкладПолучатель.ИспользоватьОрдернуюСхемуПриПоступлении = ИСТИНА
//		|				И ТаблицаТовары.Ссылка.СкладПолучатель.ДатаНачалаОрдернойСхемыПриПоступлении <= &Период
//		|				И ТаблицаТовары.Ссылка.СкладПолучатель.ДатаНачалаОрдернойСхемыПриОтраженииИзлишковНедостач <= &Период
//		|
//		|ОБЪЕДИНИТЬ ВСЕ
//		|
//		|ВЫБРАТЬ
//		|	ТаблицаТовары.Ссылка,
//		|	ТаблицаТовары.Ссылка.Дата,
//		|	ТаблицаТовары.Ссылка.СкладПолучатель,
//		|	ТаблицаТовары.Номенклатура,
//		|	ТаблицаТовары.Характеристика,
//		|	ТаблицаТовары.Назначение,
//		|	ТаблицаТовары.Серия,
//		|	ТаблицаТовары.КоличествоПоДокументу - ТаблицаТовары.Количество,
//		|	ТаблицаТовары.СтатусУказанияСерий
//		|ИЗ
//		|	Документ.АктОРасхожденияхПослеПеремещения.Товары КАК ТаблицаТовары
//		|ГДЕ
//		|	ТаблицаТовары.Ссылка В(&Ссылка)
//		|	И ТаблицаТовары.Ссылка.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.КВыполнению), ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.Отработано))
//		|	И  ТаблицаТовары.Действие В (ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ПерепоставленноеДарится))
//		|				И ТаблицаТовары.Ссылка.СкладПолучатель.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач = ИСТИНА
//		|				И ТаблицаТовары.Ссылка.СкладПолучатель.ИспользоватьОрдернуюСхемуПриПоступлении = ИСТИНА
//        	|		                И ТаблицаТовары.Ссылка.СкладПолучатель.ДатаНачалаОрдернойСхемыПриПоступлении <= &Период
//		|				И ТаблицаТовары.Ссылка.СкладПолучатель.ДатаНачалаОрдернойСхемыПриОтраженииИзлишковНедостач <= &Период";
//
//		РегистрДляДвижения = "ТоварыКОформлениюИзлишковНедостач";
//		
//		СкладыСервер.ОформитьИзлишкиНедостачиНаСкладе(Запрос, ТекстыЗапроса, РегистрДляДвижения, ТекстЗапросаДокумента);
//	КонецЕсли;
// КонецПроцедуры
 
Функция ТекстЗапросаТаблицаКОтгрузкеПоНакладным(Запрос, ТекстыЗапроса, Регистры, Документ)
	
	ИмяРегистра = "ТоварыКОтгрузкеПоНакладным";
	
	Если НЕ (ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) И
		АльтерраОбщегоНазначения.ОтгрузкаПоНакладным(Документ.Дата,Документ.СкладОтправитель)) Тогда
		Возврат "";
	КонецЕсли; 
		
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаТовары.Ссылка                 КАК Ссылка,
	|	ТаблицаТовары.Ссылка.Дата            КАК Период, 
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.Заказ В (
	|				ЗНАЧЕНИЕ(Документ.ЗаказНаПеремещение.ПустаяСсылка),
	|				НЕОПРЕДЕЛЕНО)
	|			ТОГДА
	|				НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ
	|				ТаблицаТовары.Заказ
	|	КОНЕЦ                                        КАК Заказ,
	|	ТаблицаТовары.ДокументОснование              КАК Накладная,
	|	ТаблицаТовары.Ссылка.СкладПолучатель         КАК Получатель,
	|	ТаблицаТовары.Ссылка.СкладОтправитель        КАК Склад,
	|	ТаблицаТовары.Номенклатура                   КАК Номенклатура,
	|	ТаблицаТовары.Характеристика                 КАК Характеристика,
	|	ТаблицаТовары.КоличествоПоДокументу - ТаблицаТовары.Количество КАК Количество,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК РабочийУчасток
	|ПОМЕСТИТЬ ВтТаблицаТоваров
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПеремещения.Товары КАК ТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО ТаблицаТовары.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|			И ТаблицаТовары.Ссылка.СкладОтправитель = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
	|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
	|ГДЕ
	|	ТаблицаТовары.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|	И ТаблицаТовары.Ссылка В(&Ссылка)
	|	И ТаблицаТовары.Ссылка.Статус В(
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.КВыполнению),
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.Отработано))
	|	И (
	|		ТаблицаТовары.Действие В(
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ОтгрузитьСейчас),
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ТребуетсяДопоставка),
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ДопоставкаНеТребуется),
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ВозвратПерепоставленного),
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ПокупкаПерепоставленного))) 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаТовары.Период КАК Период,
	|	ТаблицаТовары.Склад КАК Склад,
	|	ТаблицаТовары.РабочийУчасток КАК РабочийУчасток,
	|	ТаблицаТовары.Получатель КАК Получатель, 
	|	ТаблицаТовары.Заказ КАК Заказ,
	|	ТаблицаТовары.Накладная КАК Накладная,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Количество КАК КОтгрузке
	|ИЗ
	|	ВтТаблицаТоваров КАК ТаблицаТовары";
		
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
		
	Возврат ТекстЗапроса;

	
КонецФункции

&После("ЗарегистрироватьУчетныеМеханизмы")
Процедура Док_ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента)
	МеханизмыДокумента.Добавить("ОтгрузкаПоНакладным");     
КонецПроцедуры

&ИзменениеИКонтроль("ДанныеДокументаДляПроведения")
Функция Док_ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт

	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Если ТипЗнч(Документ) = Тип("ДокументОбъект.АктОРасхожденияхПослеПеремещения") Тогда
		ДокументСсылка = Документ.Ссылка;
	Иначе
		ДокументСсылка = Документ;
	КонецЕсли;	

	Запрос			= Новый Запрос;
	ТекстыЗапроса	= Новый СписокЗначений;

	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений

		ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);

		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса

		ТекстЗапросаТаблицаДвиженияСерийТоваров(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаРеестрДокументов(Запрос, ТекстыЗапроса, Регистры); 
		
		#Вставка 
		ТекстЗапросаТаблицаКОтгрузкеПоНакладным(Запрос, ТекстыЗапроса, Регистры, ДокументСсылка);
		#КонецВставки
		
	КонецЕсли;

	ОтразитьРаспределениеЗапасовДвижения(Запрос, ТекстыЗапроса, Регистры);
	ЗапланироватьПоступлениеТоваров(Запрос, ТекстыЗапроса, Регистры);
	ОформитьПриобретениеТоваровПоДвухходовке(Запрос, ТекстыЗапроса, Регистры);

	ЗапланироватьОтгрузкуТоваров(Запрос, ТекстыЗапроса, Регистры);
	ОформитьОтгрузкуТоваров(Запрос, ТекстыЗапроса, Регистры);

	ОформитьИзлишкиНедостачиНаСкладе(Запрос, ТекстыЗапроса, Регистры);

	////////////////////////////////////////////////////////////////////////////
	// Получим таблицы для движений

	Возврат ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);

КонецФункции

#КонецЕсли
